{"singlePage": [], "startSite": "", "filingNum": "", "onePageListNum": 15, "commentLabelColor": "#006b75", "yearColorList": ["#bc4c00", "#0969da", "#1f883d", "#A333D0"], "i18n": "CN", "themeMode": "manual", "dayTheme": "light", "nightTheme": "dark", "urlMode": "pinyin", "script": "", "style": "", "head": "", "indexScript": "", "indexStyle": "", "bottomText": "", "showPostSource": 1, "iconList": {}, "UTC": 8, "rssSplit": "sentence", "exlink": {}, "needComment": 1, "allHead": "", "title": "Miikka's Blog", "subTitle": "This is my blog, I will post some interesting articles including tutorials and reviews.", "avatarUrl": "https://avatars.githubusercontent.com/u/91852814?v=4", "GMEEK_VERSION": "last", "postListJson": {"P1": {"htmlDir": "docs/post/test.html", "labels": ["testing"], "postTitle": "test", "postUrl": "post/test.html", "postSourceUrl": "https://github.com/Miikka11213/miikka.github.io/issues/1", "commentNum": 0, "wordCount": 31, "description": "this is the testing issues part。", "top": 0, "createdAt": 1718814887, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/91852814?v=4", "createdDate": "2024-06-20", "dateLabelColor": "#bc4c00"}, "P2": {"htmlDir": "docs/post/Some information about this project....html", "labels": ["documentation"], "postTitle": "Some information about this project...", "postUrl": "post/Some%20information%20about%20this%20project....html", "postSourceUrl": "https://github.com/Miikka11213/miikka.github.io/issues/2", "commentNum": 0, "wordCount": 570, "description": "To begin with, this is a blog frame called Gmeek written by Meekdai you can create a repository and directly deploy it by clicking [here](https://github.com/Meekdai/Gmeek). I just wanted to include that here also to mark an interesting start to my written articles in the future.\r\n\r\nTo visit my own original webpage, redirect by clicking [miikkaarchive.com](https://miikkaarchive.com/), I am still learning HTML and thinking what I can add into this page, I also need to come up with a solution to make a portfolio for my photography works, but it will take some time.\r\n。", "top": 1, "createdAt": 1718858735, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/91852814?v=4", "createdDate": "2024-06-20", "dateLabelColor": "#bc4c00"}, "P6": {"htmlDir": "docs/post/Time Complexity Analysis of Algorithms.html", "labels": ["notes"], "postTitle": "Time Complexity Analysis of Algorithms", "postUrl": "post/Time%20Complexity%20Analysis%20of%20Algorithms.html", "postSourceUrl": "https://github.com/Miikka11213/miikka.github.io/issues/6", "commentNum": 0, "wordCount": 3479, "description": "\n# Time Complexity Analysis of Algorithms\n\nThis document explains the time complexities of common algorithms along with example code snippets for each.\n\n---\n\n## 1. **Insertion Sort**\n- **Best Case**: \\( O(n) \\) (Array is already sorted)\n- **Average Case**: \\( O(n^2) \\)\n- **Worst Case**: \\( O(n^2) \\) (Array is sorted in reverse order)\n\n### Code Example:\n```c\nvoid insertionSort(int array[], int n) {\n    for (int i = 1; i < n; i++) {\n        int key = array[i];\n        int j = i - 1;\n        while (j >= 0 && array[j] > key) {\n            array[j + 1] = array[j];\n            j--;\n        }\n        array[j + 1] = key;\n    }\n}\n```\n\n---\n\n## 2. **Bubble Sort**\n- **Best Case**: \\( O(n) \\) (Array is already sorted)\n- **Average Case**: \\( O(n^2) \\)\n- **Worst Case**: \\( O(n^2) \\) (Array is sorted in reverse order)\n\n### Code Example:\n```c\nvoid bubbleSort(int array[], int n) {\n    for (int i = 0; i < n - 1; i++) {\n        for (int j = 0; j < n - i - 1; j++) {\n            if (array[j] > array[j + 1]) {\n                int temp = array[j];\n                array[j] = array[j + 1];\n                array[j + 1] = temp;\n            }\n        }\n    }\n}\n```\n\n---\n\n## 3. **Merge Sort**\n- **Best Case**: \\( O(n \\log n) \\)\n- **Average Case**: \\( O(n \\log n) \\)\n- **Worst Case**: \\( O(n \\log n) \\)\n\n### Code Example:\n```c\nvoid merge(int array[], int left, int mid, int right) {\n    int n1 = mid - left + 1;\n    int n2 = right - mid;\n    int L[n1], R[n2];\n\n    for (int i = 0; i < n1; i++)\n        L[i] = array[left + i];\n    for (int i = 0; i < n2; i++)\n        R[i] = array[mid + 1 + i];\n\n    int i = 0, j = 0, k = left;\n    while (i < n1 && j < n2) {\n        if (L[i] <= R[j]) array[k++] = L[i++];\n        else array[k++] = R[j++];\n    }\n\n    while (i < n1) array[k++] = L[i++];\n    while (j < n2) array[k++] = R[j++];\n}\n\nvoid mergeSort(int array[], int left, int right) {\n    if (left < right) {\n        int mid = left + (right - left) / 2;\n        mergeSort(array, left, mid);\n        mergeSort(array, mid + 1, right);\n        merge(array, left, mid, right);\n    }\n}\n```\n\n---\n\n## 4. **Binary Search**\n- **Best Case**: \\( O(1) \\) (Target found at the middle)\n- **Average Case**: \\( O(\\log n) \\)\n- **Worst Case**: \\( O(\\log n) \\)\n\n### Code Example:\n```c\nint binarySearch(int array[], int n, int target) {\n    int left = 0, right = n - 1;\n    while (left <= right) {\n        int mid = left + (right - left) / 2;\n        if (array[mid] == target) return mid;\n        else if (array[mid] < target) left = mid + 1;\n        else right = mid - 1;\n    }\n    return -1;\n}\n```\n\n---\n\n## 5. **Linear Search**\n- **Best Case**: \\( O(1) \\) (Target is the first element)\n- **Average Case**: \\( O(n) \\)\n- **Worst Case**: \\( O(n) \\) (Target is not in the array or at the end)\n\n### Code Example:\n```c\nint linearSearch(int array[], int n, int target) {\n    for (int i = 0; i < n; i++) {\n        if (array[i] == target) return i;\n    }\n    return -1;\n}\n```\n\n---\n\n## Summary of Time Complexities\n\n| Algorithm              | Best Case  | Average Case | Worst Case   |\n|------------------------|------------|--------------|--------------|\n| **Insertion Sort**     | \\( O(n) \\) | \\( O(n^2) \\) | \\( O(n^2) \\) |\n| **Bubble Sort**        | \\( O(n) \\) | \\( O(n^2) \\) | \\( O(n^2) \\) |\n| **Merge Sort**         | \\( O(n \\log n) \\) | \\( O(n \\log n) \\) | \\( O(n \\log n) \\) |\n| **Binary Search**      | \\( O(1) \\) | \\( O(\\log n) \\) | \\( O(\\log n) \\) |\n| **Linear Search**      | \\( O(1) \\) | \\( O(n) \\) | \\( O(n) \\) |\n。", "top": 0, "createdAt": 1737676402, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/91852814?v=4", "createdDate": "2025-01-24", "dateLabelColor": "#0969da"}, "P7": {"htmlDir": "docs/post/What Does Plato, Socrates, and Aristotle Believe in Ethics-.html", "labels": ["philosophy"], "postTitle": "What Does Plato, Socrates, and Aristotle Believe in Ethics?", "postUrl": "post/What%20Does%20Plato%2C%20Socrates%2C%20and%20Aristotle%20Believe%20in%20Ethics-.html", "postSourceUrl": "https://github.com/Miikka11213/miikka.github.io/issues/7", "commentNum": 0, "wordCount": 3185, "description": "# What Does Plato, Socrates, and Aristotle Believe in Ethics?\n\nTo begin with, think about this problem, is having power good? Furthermore, what justifies having power, is it if you are smart, or rich, or taller or stronger? The Greek philosopher Socrates believes that power is either the truth or its good. \n\n![Image](https://github.com/user-attachments/assets/5af59766-5b17-406d-b8c6-fb9ab0b5d666)\n\nPlato wrote a Socratic dialogue called _Gorgias_. In this article, Socrates is arguing with Callicles on who is better and if the parameters of being better affects their life style. In justice and natural order, Callicles argues by nature, the stronger, more intelligence, braver, should rule over others and take a larger scale of resources, but Socrates thinks are the “better” always equates to stronger or more intelligent?  The real power is related to daily life, as Socrates argue that having better self-control and having orderly life leads to happiness. \n\nBut fulfilment comes from satisfying desires without restraint, especially for the naturally superior. This is an interesting point, are things that makes you happy always the right thing to do? And when achieving the desired goal, is the process always happy and joyful? This question was fully discussed in class, there are many contrapositive and contradictive statements. For example, doing cocaine could end up happy, but drugs in general is bad. Being sick and requires a surgery might cause physical pain, but in the end, you heal up and become healthy again, the process is bad. If good things can lead into bad, and bad things lead into good, are all good things good and bad things bad?\n\nSocrates uses a jar analogy to describe people, those who have disciplined like has sound jars, and indiscipline person has leaky jars, requires constant refilling, which symbolises endless desires. The overall article is a **Critique of Hedonism**, Socrates critiques the hedonistic view that happiness comes from indulging in pleasures, showing the emptiness of such a life without restraint or purpose.\n\nAristotle’s Nicomachean Ethics states that the highest good, or _eudaimonia_ (“happiness and flourishing”) achieves by living a life of rational activities in accordance with virtue. And virtue as a “mean” between deficiency and excess.\n:- Courage lies between recklessness and cowardice\n:- Generosity lies between wastefulness and stinginess\n\n### What is ‘end’? What ‘science’ investigates it?\nEverything that aims at an end is good, therefore, some ‘good’ is what we aim at. Pollical science investigates it, political tells society how to act, it’s about governing and behaviour. \n\n### How is happiness acquired?\nAristotle argues that it is a sort of habituation, and there are two kinds of virtue:\n:- Intellectual – can be taught or read from book\n:- Moral – rational thought requires time and thought\n\nThe Greeks believe truth might not be a thing, because everything is seen from our human eyes. Imagine you are a goat, or a cow, or a fish. Since they have different eyes, the world they see differs from what we see. \n\nIn the end, it leaves us with two things. **Moral** quality or **Physical** quantity.\n。", "top": 0, "createdAt": 1737678758, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/91852814?v=4", "createdDate": "2025-01-24", "dateLabelColor": "#0969da"}, "P8": {"htmlDir": "docs/post/Ways of Living- Ethics Across Classical Philosophies.html", "labels": ["philosophy"], "postTitle": "Ways of Living: Ethics Across Classical Philosophies", "postUrl": "post/Ways%20of%20Living-%20Ethics%20Across%20Classical%20Philosophies.html", "postSourceUrl": "https://github.com/Miikka11213/miikka.github.io/issues/8", "commentNum": 0, "wordCount": 8545, "description": "### Ways of Living: Ethics Across Classical Philosophies @Miikka11212 \n\n\n\nEthics is often discussed as a question of right and wrong, but in classical philosophy, it gets deeper and more complicated than a set of rules or commandments. It is a question of how we should live, what kind of life is worth living, and what it means to live rightly. Throughout the semester, we covered thinkers from Greece, China, and India all approached this question from different angles, shaped by their cultures, histories, and metaphysical assumptions. This essay aims to inform and explain how different classical philosophers in different regions understood ethical living, explore each of theirs epistemological and metaphysical foundations, and the diversity of ethical thought. \n\nTo begin with Epistemology, a study of nature, origin, and limits of knowledge, plays a fundamental role on how these classical thinkers arrive at their ethical frameworks. In Greek philosophy, Plato distinguishes between knowledge and belief, arguing that true knowledge is of the unchanging forms, while opinions are about the fluctuating world of the senses. He did several contraries on empiricism and rationalism, with one being knowledge from sensual experience and one based on reason. In the *Republic*, Plato describes whether someone lives in a dream-like, illusory state, which refers to belief, or in reality, as to knowledge, \n\n> “So wouldn’t we be right to describe the difference between their mental states by saying that while this person has knowledge, the other one has beliefs?” (Republic, 476e). \n\nThis comes right after a contrast between two kinds of people, one who only sees particulars but not beauty itself, and one who sees forms, which is the real world and knowledge. Another Greek philosopher, Aristotle also propose on how knowledge is formed. He thinks that knowledge is inductive, \n\n> “We must get to know the primary premises by induction; for the method by which even sense-perception implants the universal is inductive” (Posterior Analytics, 100b). \n\nAristotle is saying knowledge and sensual experience are not against each other, but knowledge derives from experience. Knowledge begins with perception, then comes memory and experience. Both Plato and Aristotle argue that true knowledge is essential for living rightly. For Plato, distinguishing knowledge from belief allows one to escape illusion and align with eternal truths like justice itself. For Aristotle, knowledge emerges from experience and leads to true understanding. In both views, to live well, one must first learn to see clearly.\n\nIn Chinese epistemology from Chuang Tzu, he proposed a totally different view, instead of focusing on what knowledge is, he focuses on how knowledge is like as a matter. In Chuang Tzu:\n\n> “How can I know that what I say I know is not actually what I don’t know? Likewise, how can I know that what I think I don’t know is not really what I do know?” (Chuang Tzu, 283). \n\nHe explains that knowledge is skeptical and relativistic, instable. And since no one can understand ultimately what another one is thinking or understand, there might not be right and wrong and knowledge can be unknown and endless. For him, to live well is to let go of rigid judgements, embrace the constant transformation of things. Similar to Tao Te Ching, instead of seeking fixed truths, no matter beliefs or true knowledge, the wise person lives freely. \n\nStepping into metaphysics, another major branch of classical philosophy. Metaphysics deals with the first principles of things, including abstract concepts such as being, knowing, time, and space. The Tao Te Ching teaches that the Way (Tao) is the subtle, formless origin of all things, it’s too vast and ineffable to be captured in words or fixed principles. In the very beginning, \n\n> “The Tao that can be told is not the eternal Tao; the name that can be named is not the eternal name” (Tao Te Ching, 1). \n\nOn top of Chuang Tzu, the Tao says instead of rigid doctrines, the text promotes harmony, spontaneity, and humility, urging people to act in accordance with the Tao through Wu Wei “non-action” or effortless action. To live rightly, therefore, is not to follow rigid rules, but to return to simplicity, emptiness, and natural harmony, aligning with the deeper rhythm of the universe rather than resisting it.\n\nIndian metaphysics on the other hand, especially in the Buddhist tradition, teaches that the world is interdependent, impermanent, and ultimately empty of a fixed self. To sum up, they believe that nothing exists on its own and everything is in constant change, kind of similar to the Tao. Nargajuna deepens this view by rejecting both extremes, that either anything truly exists (externalism), or anything is completely nonexistent (nihilism). In this part, Nargajuna states that \n\n> “There is no difference at all between Nirvana and Samsara.” (Gotama, Chapter XXV, XIX). \n\nFor Nagarjuna, all things are empty of inherent essence, but that doesn’t mean they’re false, it means they depend on other things to exist. This emptiness is not something to fear, but to recognize, because \n\n> “The bliss consists in the cessation of all thought, in the quiescence of plurality.”\n\n. Indian metaphysics teaches us to let go of ego, craving, and fixed identities. Nirvana is not found in escaping to another world, but in understanding the nature of this one. To live rightly is to live with non-attachment, mindfulness, and compassion, because we see that nothing exists independently and lasts forever.\n\nAt last, the topic of ethics itself. Ethics discusses on how a person should act, what principles guide our choices, how we live day to day, basically what it means to live well. So how do these philosophers approach the question of ethics? In Plato’s Gorgias, Socrates and Callicles debate whether justice and self-control lead to a better life, or whether power and indulgence do. Socrates insists that ethical life requires mastering oneself, while Callicles argues that real success comes from satisfying one’s desires. Aristotle moves beyond this and defines the ethical life as achieving eudaimonia flourishing through reason, virtue, and habit. In contrast, Mencius believes humans are naturally good, and that ethics is about returning to this goodness through nurturing environments. Xunzi, however, claims human nature is evil and only disciplined structures like rituals and laws create moral order. Indian thought emphasises on inner duty and encourages detachment from personal gain, suggesting that ethical living is rooted in discipline and letting go of desires. Despite their differences, all these views point to a common concern: how we live matters, and ethics offers the framework for becoming fully human, not by instinct alone, but through thoughtful cultivation of the self. \n\nIn conclusion, ethics is a widely discussed topic throughout classical philosophies. While metaphysics and epistemology are deeply connected to ethics, so too is ethics shaped by our understanding of reality and knowledge. These philosophers do not just teach us abstract theories, they guide us on how to think, how to judge, and ultimately how to live a righteous life. Across traditions, whether through reason, discipline, or harmony, ethics is the bridge between thought and action, showing us what it means to be fully human.\n\nLastly I wanna include my favourite mathematical formula, it is the Gamma functions, it introduces factorial on real numbers and complex numbers.\n\n$$\\Gamma (z) = \\int^{\\infty}_{0} t^{z-1} e^{-t} dt$$ \n \n\n> Citation\n> Plato – Republic\n>     Plato. Republic. Translated by R. Waterfield, Oxford University Press, 1993, pp. 196–202, 233–245. Provided in course materials.\n> Chuang Tzu – Epistemology\n>     Chuang Tzu. The Book of Chuang Tzu. Translated by Martin Palmer, Penguin, 1996, pp. 8–20. Provided in course materials.\n> Tao Te Ching – Laozi\n>     Laozi. Tao Te Ching. Translated and compiled by Wing-Tsit Chan, A Source Book in Chinese Philosophy, Princeton University Press, 1969, pp. 139– \n>    150, 152–154, 156–164, 166, 172. Provided in course materials.\n> Nyaya Sutras & Nagarjuna\n>     Gotama and Nagarjuna. Nyaya Sutras and Madhyamaka Karika. Provided in course materials as “Nyaya Sutras & Nagarjuna.pdf.”\n> Buddhist Metaphysics\n>     “Conditioned Genesis” and “Lalitavistara.” From Buddhist Texts Through the Ages, edited and translated by Edward Conze, Shambhala, 1990, pp. \n>     65–70, 91–94, 158–161. Provided in course materials.\n\n。", "top": 0, "createdAt": 1744855526, "style": "", "script": "<script>MathJax = {tex: {inlineMath: [[\"$\", \"$\"]]}};</script><script async src=\"https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js\"></script>", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/91852814?v=4", "createdDate": "2025-04-17", "dateLabelColor": "#0969da"}}, "singeListJson": {}, "labelColorDict": {"bug": "#d73a4a", "documentation": "#0075ca", "notes": "#F9D0C4", "philosophy": "#AEDC32", "testing": "#1d76db"}, "displayTitle": "Miikka's Blog", "faviconUrl": "https://avatars.githubusercontent.com/u/91852814?v=4", "ogImage": "https://avatars.githubusercontent.com/u/91852814?v=4", "primerCSS": "<link href='https://mirrors.sustech.edu.cn/cdnjs/ajax/libs/Primer/21.0.7/primer.css' rel='stylesheet' />", "homeUrl": "https://Miikka11213.github.io/miikka.github.io", "prevUrl": "disabled", "nextUrl": "disabled"}